<template>
  <div id="page">
    <Headers></Headers>
    <section id="page">
      <BannersTilte :keys="keys"></BannersTilte>
      <Collapse :keys="'products'" :list="products" />
      <Collapse :keys="'operation'" :list="operation" />
      <Collapse :keys="'tech'" :list="tech" />
      <section class="text-center pt-3 pb-5">
        <h1>還是不夠了解嗎?</h1>
        <n-link to="/reservation" tag="button" class="btn btn-primary" exact-active-class>預約諮詢</n-link>
        <!-- <button type="button" class="btn btn-primary">預約諮詢</button> -->
      </section>
      <Footers></Footers>
    </section>
  </div>
</template>

<script>
export default {
  data() {
    return {
      keys: "question",
      products: [
        { name: "什麼是星禮程My Starbucks Rewards™ ?", desc: "星禮程 My Starbucks Rewards™ 是結合STARBUCKS隨行卡所推出的全新會員回饋制度，當您完成星禮程註冊後即成為星禮程會員，除了可享有記名相關服務及保障外，當您持帳號中之任一張隨行卡或使用星巴克APP行動支付，單筆全額支付消費金額每滿新台幣35元可獲贈 1 顆星 ( 70 元 2 顆星…以此類推，不足 35 元的金額恕不累計計算)，其星星將累積記錄於您的帳號中，當獲贈的星星數累計達到等級資格時，您可享有該等級的回饋項目，同時星巴克也將不定期舉辦星禮程相關專屬行銷活動，讓您享受更多的驚喜與回饋！" },
        { name: "如何加入星禮程 My Starbucks Rewards™?", desc: "您可直接於星巴克網站或星巴克APP註冊星禮程帳號，當您完成星禮程註冊後即成為星禮程會員，您的帳號中將會自動生效一張電子卡。只要您持星禮程帳號中任一張隨行卡或APP行動支付至門市全額支付消費金額，均可獲贈星星數並享有您的星禮程等級回饋，您也可以透過APP隨時查詢您的星禮程回饋。" },
        { name: "當我達到星禮程等級時，什麼時候我可以開始享有等級回饋?", desc: "若您成功達到獲贈的星禮程等級時，立即可享有該等級資格的各項回饋，獲贈的等級資格及星星資料將會在24小時內被記錄更新在您的星禮程帳號中，您將可在所註冊的Email信箱收到通知訊息，或是可至星巴克網站中的星禮程網頁或星巴克APP中查詢。" },
        { name: "我的星禮程等級與星星有期限嗎?", desc: "有的。您的星禮程等級資格為等級資格生效日起12個月內有效，已獲贈累計的“星星”無論是被展延資格或降回前一個等級，在每12個月週期中，帳號中的星星數均會被歸零，您可在星禮程網頁或APP中查詢您的等級到期日及相關資訊。若您的等級資格為綠星級或金星級，且在等級資格有效期間內再獲贈的星星數，達到延續隔年資格的數量時，您的等級到期日將會展延12個月乙次。若您累計再獲贈的星星數未能達到保留隔年資格的數量時，您獲贈的等級資格，將會在該等級資格到期日隔日降回前一個等級，請您特別留意。" },
        { name: "什麼是星禮程My Starbucks Rewards™ ?", desc: "星禮程 My Starbucks Rewards™ 是結合STARBUCKS隨行卡所推出的全新會員回饋制度，當您完成星禮程註冊後即成為星禮程會員，除了可享有記名相關服務及保障外，當您持帳號中之任一張隨行卡或使用星巴克APP行動支付，單筆全額支付消費金額每滿新台幣35元可獲贈 1 顆星 ( 70 元 2 顆星…以此類推，不足 35 元的金額恕不累計計算)，其星星將累積記錄於您的帳號中，當獲贈的星星數累計達到等級資格時，您可享有該等級的回饋項目，同時星巴克也將不定期舉辦星禮程相關專屬行銷活動，讓您享受更多的驚喜與回饋！" },
        { name: "如何加入星禮程 My Starbucks Rewards™?", desc: "您可直接於星巴克網站或星巴克APP註冊星禮程帳號，當您完成星禮程註冊後即成為星禮程會員，您的帳號中將會自動生效一張電子卡。只要您持星禮程帳號中任一張隨行卡或APP行動支付至門市全額支付消費金額，均可獲贈星星數並享有您的星禮程等級回饋，您也可以透過APP隨時查詢您的星禮程回饋。" }
      ],
      operation: [
        { name: "星禮程 My Starbucks Rewards™ 的回饋內容有那些?", desc: "當您在完成註冊加入星禮程後的 12 個月內，您的帳號中若獲贈累積 66 顆星，您將免費從“新星級”升等到“綠星級”，若累積 168 顆星，將免費升等到 金星級，各等級均有其回饋內容，您可至星禮程專區之網頁瀏覽詳細內容。" },
        { name: "我是否能查詢我的等級、星星數量及回饋優惠項目?", desc: "當然可以！您的星禮程等級與回饋項目均已連結至您的星禮程帳號中，您可至星巴克網站中的星禮程網頁或星巴克APP中查詢，或至星巴克門市由現場服務人員協助您查詢。" },
        { name: "什麼是星禮程My Starbucks Rewards™ ?", desc: "星禮程 My Starbucks Rewards™ 是結合STARBUCKS隨行卡所推出的全新會員回饋制度，當您完成星禮程註冊後即成為星禮程會員，除了可享有記名相關服務及保障外，當您持帳號中之任一張隨行卡或使用星巴克APP行動支付，單筆全額支付消費金額每滿新台幣35元可獲贈 1 顆星 ( 70 元 2 顆星…以此類推，不足 35 元的金額恕不累計計算)，其星星將累積記錄於您的帳號中，當獲贈的星星數累計達到等級資格時，您可享有該等級的回饋項目，同時星巴克也將不定期舉辦星禮程相關專屬行銷活動，讓您享受更多的驚喜與回饋！" },
        { name: "如何加入星禮程 My Starbucks Rewards™?", desc: "您可直接於星巴克網站或星巴克APP註冊星禮程帳號，當您完成星禮程註冊後即成為星禮程會員，您的帳號中將會自動生效一張電子卡。只要您持星禮程帳號中任一張隨行卡或APP行動支付至門市全額支付消費金額，均可獲贈星星數並享有您的星禮程等級回饋，您也可以透過APP隨時查詢您的星禮程回饋。" },
        { name: "當我達到星禮程等級時，什麼時候我可以開始享有等級回饋?", desc: "若您成功達到獲贈的星禮程等級時，立即可享有該等級資格的各項回饋，獲贈的等級資格及星星資料將會在24小時內被記錄更新在您的星禮程帳號中，您將可在所註冊的Email信箱收到通知訊息，或是可至星巴克網站中的星禮程網頁或星巴克APP中查詢。" },
        { name: "我的星禮程等級與星星有期限嗎?", desc: "有的。您的星禮程等級資格為等級資格生效日起12個月內有效，已獲贈累計的“星星”無論是被展延資格或降回前一個等級，在每12個月週期中，帳號中的星星數均會被歸零，您可在星禮程網頁或APP中查詢您的等級到期日及相關資訊。若您的等級資格為綠星級或金星級，且在等級資格有效期間內再獲贈的星星數，達到延續隔年資格的數量時，您的等級到期日將會展延12個月乙次。若您累計再獲贈的星星數未能達到保留隔年資格的數量時，您獲贈的等級資格，將會在該等級資格到期日隔日降回前一個等級，請您特別留意。" },
        { name: "什麼是星禮程My Starbucks Rewards™ ?", desc: "星禮程 My Starbucks Rewards™ 是結合STARBUCKS隨行卡所推出的全新會員回饋制度，當您完成星禮程註冊後即成為星禮程會員，除了可享有記名相關服務及保障外，當您持帳號中之任一張隨行卡或使用星巴克APP行動支付，單筆全額支付消費金額每滿新台幣35元可獲贈 1 顆星 ( 70 元 2 顆星…以此類推，不足 35 元的金額恕不累計計算)，其星星將累積記錄於您的帳號中，當獲贈的星星數累計達到等級資格時，您可享有該等級的回饋項目，同時星巴克也將不定期舉辦星禮程相關專屬行銷活動，讓您享受更多的驚喜與回饋！" },
        { name: "如何加入星禮程 My Starbucks Rewards™?", desc: "您可直接於星巴克網站或星巴克APP註冊星禮程帳號，當您完成星禮程註冊後即成為星禮程會員，您的帳號中將會自動生效一張電子卡。只要您持星禮程帳號中任一張隨行卡或APP行動支付至門市全額支付消費金額，均可獲贈星星數並享有您的星禮程等級回饋，您也可以透過APP隨時查詢您的星禮程回饋。" }
      ],
      tech: [
        { name: "當我達到星禮程等級時，什麼時候我可以開始享有等級回饋?", desc: "若您成功達到獲贈的星禮程等級時，立即可享有該等級資格的各項回饋，獲贈的等級資格及星星資料將會在24小時內被記錄更新在您的星禮程帳號中，您將可在所註冊的Email信箱收到通知訊息，或是可至星巴克網站中的星禮程網頁或星巴克APP中查詢。" },
        { name: "我的星禮程等級與星星有期限嗎?", desc: "有的。您的星禮程等級資格為等級資格生效日起12個月內有效，已獲贈累計的“星星”無論是被展延資格或降回前一個等級，在每12個月週期中，帳號中的星星數均會被歸零，您可在星禮程網頁或APP中查詢您的等級到期日及相關資訊。若您的等級資格為綠星級或金星級，且在等級資格有效期間內再獲贈的星星數，達到延續隔年資格的數量時，您的等級到期日將會展延12個月乙次。若您累計再獲贈的星星數未能達到保留隔年資格的數量時，您獲贈的等級資格，將會在該等級資格到期日隔日降回前一個等級，請您特別留意。" },
        { name: "什麼是星禮程My Starbucks Rewards™ ?", desc: "星禮程 My Starbucks Rewards™ 是結合STARBUCKS隨行卡所推出的全新會員回饋制度，當您完成星禮程註冊後即成為星禮程會員，除了可享有記名相關服務及保障外，當您持帳號中之任一張隨行卡或使用星巴克APP行動支付，單筆全額支付消費金額每滿新台幣35元可獲贈 1 顆星 ( 70 元 2 顆星…以此類推，不足 35 元的金額恕不累計計算)，其星星將累積記錄於您的帳號中，當獲贈的星星數累計達到等級資格時，您可享有該等級的回饋項目，同時星巴克也將不定期舉辦星禮程相關專屬行銷活動，讓您享受更多的驚喜與回饋！" },
        { name: "如何加入星禮程 My Starbucks Rewards™?", desc: "您可直接於星巴克網站或星巴克APP註冊星禮程帳號，當您完成星禮程註冊後即成為星禮程會員，您的帳號中將會自動生效一張電子卡。只要您持星禮程帳號中任一張隨行卡或APP行動支付至門市全額支付消費金額，均可獲贈星星數並享有您的星禮程等級回饋，您也可以透過APP隨時查詢您的星禮程回饋。" }
      ]
    };
  },
  created() {
    console.log(1235555);
  }
};
</script>

<style>
</style>
